[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:6:9
     public class StringManipulator
     {
         public static string ReverseString(string input, byte charLenght = 255)
-        { 
-            char[] stringArray = input.ToCharArray()
-                                        .Take(charLenght)
-                                            .ToArray();
-
-            string reversed_limited = string.Empty;
-
-            for (int i = stringArray.Length - 1; i >= 0; i--)
-            {
-                reversed_limited += stringArray[i];
-            }
-
-            return reversed_limited;
-        }
+        {}
 
         public static string ToLower(string input) 

[Killed] Linq method mutation (Take() to Skip())
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:7:34
     {
         public static string ReverseString(string input, byte charLenght = 255)
         { 
-            char[] stringArray = input.ToCharArray()
-                                        .Take(charLenght)
-                                            .ToArray();
+            char[] stringArray = input.ToCharArray()
+                                        .Skip(charLenght)
+                                            .ToArray();
 
             string reversed_limited = string.Empty;

[Killed] String mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:11:39
                                         .Take(charLenght)
                                             .ToArray();
 
-            string reversed_limited = string.Empty;
+            string reversed_limited = "Stryker was here!";
 
             for (int i = stringArray.Length - 1; i >= 0; i--)

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:13:50
 
             string reversed_limited = string.Empty;
 
-            for (int i = stringArray.Length - 1; i >= 0; i--)
+            for (int i = stringArray.Length - 1; i < 0; i--)
             {
                 reversed_limited += stringArray[i];

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:13:50
 
             string reversed_limited = string.Empty;
 
-            for (int i = stringArray.Length - 1; i >= 0; i--)
+            for (int i = stringArray.Length - 1; i > 0; i--)
             {
                 reversed_limited += stringArray[i];

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:14:13
             string reversed_limited = string.Empty;
 
             for (int i = stringArray.Length - 1; i >= 0; i--)
-            {
-                reversed_limited += stringArray[i];
-            }
+            {}
 
             return reversed_limited;

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:22:9
         }
 
         public static string ToLower(string input) 
-        {
-            String output = "";
-            for (int i = 0; i < input.Length; i++)
-            {
-                if (input[i] >= 'A' && input[i] <= 'Z')
-                {
-                    output += (char)(input[i] - 'A' + 'a');
-                }
-                else
-                    output += input[i];
-            }
-            return output;
-        }
+        {}
         public static string ToUpper(string input) 
         {

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:24:29
         public static string ToLower(string input) 
         {
             String output = "";
-            for (int i = 0; i < input.Length; i++)
+            for (int i = 0; i <= input.Length; i++)
             {
                 if (input[i] >= 'A' && input[i] <= 'Z')

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:24:29
         public static string ToLower(string input) 
         {
             String output = "";
-            for (int i = 0; i < input.Length; i++)
+            for (int i = 0; i > input.Length; i++)
             {
                 if (input[i] >= 'A' && input[i] <= 'Z')

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:25:13
         {
             String output = "";
             for (int i = 0; i < input.Length; i++)
-            {
-                if (input[i] >= 'A' && input[i] <= 'Z')
-                {
-                    output += (char)(input[i] - 'A' + 'a');
-                }
-                else
-                    output += input[i];
-            }
+            {}
             return output;
         }

[Killed] Negate expression
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:26:21
             String output = "";
             for (int i = 0; i < input.Length; i++)
             {
-                if (input[i] >= 'A' && input[i] <= 'Z')
+                if (!(input[i] >= 'A' && input[i] <= 'Z'))
                 {
                     output += (char)(input[i] - 'A' + 'a');

[Killed] Logical mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:26:21
             String output = "";
             for (int i = 0; i < input.Length; i++)
             {
-                if (input[i] >= 'A' && input[i] <= 'Z')
+                if (input[i] >= 'A' || input[i] <= 'Z')
                 {
                     output += (char)(input[i] - 'A' + 'a');

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:27:17
             for (int i = 0; i < input.Length; i++)
             {
                 if (input[i] >= 'A' && input[i] <= 'Z')
-                {
-                    output += (char)(input[i] - 'A' + 'a');
-                }
+                {}
                 else
                     output += input[i];

[Killed] Arithmetic mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:28:38
             {
                 if (input[i] >= 'A' && input[i] <= 'Z')
                 {
-                    output += (char)(input[i] - 'A' + 'a');
+                    output += (char)(input[i] + 'A'  + 'a');
                 }
                 else

[Killed] Arithmetic mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:28:38
             {
                 if (input[i] >= 'A' && input[i] <= 'Z')
                 {
-                    output += (char)(input[i] - 'A' + 'a');
+                    output += (char)(input[i] - 'A' - 'a');
                 }
                 else

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:36:9
             return output;
         }
         public static string ToUpper(string input) 
-        {
-            String output = "";
-            for (int i = 0; i < input.Length; i++)
-            {
-                if (input[i] >= 'a' && input[i] <= 'z')
-                {
-                    output += (char)(input[i] - 'a' + 'A');
-                }
-                else
-                    output += input[i];
-            }
-            return output;
-        }
+        {}
     }
 }

[Killed] String mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:37:29
         }
         public static string ToUpper(string input) 
         {
-            String output = "";
+            String output = "Stryker was here!";
             for (int i = 0; i < input.Length; i++)
             {

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:38:47
         public static string ToUpper(string input) 
         {
             String output = "";
-            for (int i = 0; i < input.Length; i++)
+            for (int i = 0; i < input.Length; i--)
             {
                 if (input[i] >= 'a' && input[i] <= 'z')

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:39:13
         {
             String output = "";
             for (int i = 0; i < input.Length; i++)
-            {
-                if (input[i] >= 'a' && input[i] <= 'z')
-                {
-                    output += (char)(input[i] - 'a' + 'A');
-                }
-                else
-                    output += input[i];
-            }
+            {}
             return output;
         }

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:40:40
             String output = "";
             for (int i = 0; i < input.Length; i++)
             {
-                if (input[i] >= 'a' && input[i] <= 'z')
+                if (input[i] >= 'a' && input[i] > 'z')
                 {
                     output += (char)(input[i] - 'a' + 'A');

[Killed] Equality mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:40:21
             String output = "";
             for (int i = 0; i < input.Length; i++)
             {
-                if (input[i] >= 'a' && input[i] <= 'z')
+                if (input[i] < 'a'  && input[i] <= 'z')
                 {
                     output += (char)(input[i] - 'a' + 'A');

[Killed] Block removal mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:41:17
             for (int i = 0; i < input.Length; i++)
             {
                 if (input[i] >= 'a' && input[i] <= 'z')
-                {
-                    output += (char)(input[i] - 'a' + 'A');
-                }
+                {}
                 else
                     output += input[i];

[Killed] Arithmetic mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:42:38
             {
                 if (input[i] >= 'a' && input[i] <= 'z')
                 {
-                    output += (char)(input[i] - 'a' + 'A');
+                    output += (char)(input[i] + 'a'  + 'A');
                 }
                 else

[Killed] Arithmetic mutation
repos/StringManipulator/StringManipulatorLib/StringManipulator.cs:42:38
             {
                 if (input[i] >= 'a' && input[i] <= 'z')
                 {
-                    output += (char)(input[i] - 'a' + 'A');
+                    output += (char)(input[i] - 'a' - 'A');
                 }
                 else
